In [4]:
import pandas as pd

rates = pd.read_csv(
    "../ml-1m/ratings.dat",
    sep="::",
    engine="python",
    names=["user_id", "movie_id", "rating", "timestamp"],
    encoding="latin-1"
)

rates.head()

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [5]:
users = pd.read_csv("../users.csv")
users.head()

   user_id gender  occupation  age_group_id
0        1      F          11             1
1        2      M          17             7
2        3      M          16             3
3        4      M           8             5
4        5      M          21             3

In [6]:
movies = pd.read_csv("../movies.csv")
movies.head()

,movie_id,title,year,rated,plot,imdb_rating,imdb_id
0,1,Toy Story,1995,4.0,A cowboy doll is profoundly jealous when a new...,8.3,tt0114709
1,2,Jumanji,1995,2.0,A magic board game summons jungle perils and a...,7.1,tt0113497
2,3,Grumpier Old Men,1995,3.0,Just as John and Max resolve to save their bel...,6.7,tt0113228
3,4,Waiting to Exhale,1995,1.0,"Based on Terry McMillan's novel, this film fol...",6.0,tt0114885
4,5,Father of the Bride Part II,1995,2.0,George Banks must deal not only with his daugh...,6.1,tt0113041

In [8]:
valid_user_ids = set(users["user_id"])
valid_movie_ids = set(movies["movie_id"])

print("Before:" + str(len(rates)))
rates_clean = rates[
    rates["user_id"].isin(valid_user_ids) &
    rates["movie_id"].isin(valid_movie_ids)
].copy()
print("After:" + str(len(rates_clean)))

Before:1000209
After:948367

In [9]:
rates_clean["datetime"] = pd.to_datetime(
    rates_clean["timestamp"],
    unit="s",
    utc=True
)
rates_clean.drop

         user_id  movie_id  rating  timestamp                  datetime
0              1      1193       5  978300760 2000-12-31 22:12:40+00:00
1              1       661       3  978302109 2000-12-31 22:35:09+00:00
2              1       914       3  978301968 2000-12-31 22:32:48+00:00
3              1      3408       4  978300275 2000-12-31 22:04:35+00:00
4              1      2355       5  978824291 2001-01-06 23:38:11+00:00
...          ...       ...     ...        ...                       ...
1000204     6040      1091       1  956716541 2000-04-26 02:35:41+00:00
1000205     6040      1094       5  956704887 2000-04-25 23:21:27+00:00
1000206     6040       562       5  956704746 2000-04-25 23:19:06+00:00
1000207     6040      1096       4  956715648 2000-04-26 02:20:48+00:00
1000208     6040      1097       4  956715569 2000-04-26 02:19:29+00:00

[948367 rows x 5 columns]

In [10]:
rates_clean = rates_clean.drop("timestamp", axis=1)

In [11]:
rates_clean.to_csv("../user_movie_rates.csv", index=False, encoding="utf-8")